---
title: RegenFailures
classe: Autodesk.Revit.DB.BuiltInFailures+RegenFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 22
---

# RegenFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotRegenFamily { get; }` | `RegenFailures.CannotRegenFamily` | FailureDefinitionId |
| `FailureDefinitionId CircularDependency { get; }` | `RegenFailures.CircularDependency` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyAssocProp { get; }` | `RegenFailures.CircularDependencyAssocProp` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyAssocPropError { get; }` | `RegenFailures.CircularDependencyAssocPropError` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyConstraint { get; }` | `RegenFailures.CircularDependencyConstraint` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyConstraintError { get; }` | `RegenFailures.CircularDependencyConstraintError` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyError { get; }` | `RegenFailures.CircularDependencyError` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyResolved { get; }` | `RegenFailures.CircularDependencyResolved` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencySketch { get; }` | `RegenFailures.CircularDependencySketch` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencySketchError { get; }` | `RegenFailures.CircularDependencySketchError` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyUncut { get; }` | `RegenFailures.CircularDependencyUncut` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyUncutError { get; }` | `RegenFailures.CircularDependencyUncutError` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyWall { get; }` | `RegenFailures.CircularDependencyWall` | FailureDefinitionId |
| `FailureDefinitionId CircularDependencyWallError { get; }` | `RegenFailures.CircularDependencyWallError` | FailureDefinitionId |
| `FailureDefinitionId ForceRegenSketch { get; }` | `RegenFailures.ForceRegenSketch` | FailureDefinitionId |
| `FailureDefinitionId GeomStepFailed { get; }` | `RegenFailures.GeomStepFailed` | FailureDefinitionId |
| `FailureDefinitionId GeomStepFailedError { get; }` | `RegenFailures.GeomStepFailedError` | FailureDefinitionId |
| `FailureDefinitionId RegenElements { get; }` | `RegenFailures.RegenElements` | FailureDefinitionId |
| `FailureDefinitionId RegeneratedElements { get; }` | `RegenFailures.RegeneratedElements` | FailureDefinitionId |
| `FailureDefinitionId RegenFailure { get; }` | `RegenFailures.RegenFailure` | FailureDefinitionId |
| `FailureDefinitionId UserCancelled { get; }` | `RegenFailures.UserCancelled` | FailureDefinitionId |
| `FailureDefinitionId UserCancelledError { get; }` | `RegenFailures.UserCancelledError` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```